# Week 5
- pandas
- numpy

### Pandas
- pandas is an open source Python library providing high-performance, easy-to-use data structures and data analysis tools.
- runs on top of Numpy (dependency)
    - mixed types
    - column and row names
    - time series functionality
    - lots of input and output formats (csv, excel, etc.)
    - easy plotting with matplotlib
- very popular for data science

##### Pandas vs. Numpy
- NumPy:
    - low-level data structure (np.array)
    - support for large multi-dimentional arrays and matrices
    - a wide range of mathematical array operations
    - [NumPy Section](#NumPy)


- Pandas:
    - high-level data structures (data frame)
    - more streamlined handling of tabular data and rich time series functionality
    - data alignment, missing-data friendly statistics, groupby, merge and join methods
    - you can use Pandas data structures, and freely draw on NumPy functions to manipulate them
    - [Pandas basics](#Pandas1)
    - [Pandas agg/transform..](#Pandas2)
    - [Pandas review and micellaneous](#Pandas3)

In [1]:
import numpy as np
import pandas as pd

### Pandas1
##### Pandas data structures:
- Series 
- DataFrame

- Series: one-dimensional object (like a list or a 1d ndarray). Additionally, a Series stores an array of data labels, called its index.
    - Python represents the Series with the index on the left and the values on the right
    - since we didn't specify an index, the default is like a list: 0 through n-1 where n is the length of the data
    - Pandas automatically assigns a datatype(dtype) of integer (int64) to this Series

In [2]:
##### Creating series from a list:
s = pd.Series([3, 10, 5, 4, -1])
s

0     3
1    10
2     5
3     4
4    -1
dtype: int64

In [3]:
##### To specify a label for each point in the Seires, called an index:
s = pd.Series([3, 10, 5, 4],
             index = ["Dorothy", "Alice", "Chris", "Bob"])
print(s)

print("\n")

##### Alternative:
s_data = {
    "Ohio": 35000,
    "Texas": 71000,
    "Oregon": 16000,
    "Utah": 5000
}

s2 = pd.Series(s_data)
print(s2)

Dorothy     3
Alice      10
Chris       5
Bob         4
dtype: int64


Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [4]:
##### Using an index to select from the series
print(s["Chris"])
s["Bob"] = -10   # assignment
print(s[["Alice", "Bob"]])   # select multiple by passing a list

5
Alice    10
Bob     -10
dtype: int64

In [5]:
##### Operations:
print(s * 2)
print("\n")
print(s >= 10)
print("\n")
print(s.sum())

Dorothy     6
Alice      20
Chris      10
Bob       -20
dtype: int64


Dorothy    False
Alice       True
Chris      False
Bob        False
dtype: bool


8

In [6]:
##### Filtering in Series:
print(s[s >= 10])

print("\n")

print("Alice" in s)

Alice    10
dtype: int64


True

In [7]:
##### missing values
# get a sub-series without the missing values
print(s2.dropna())

print("\n")

# get a boolean series
print(s2.isnull())

print("\n")

print(s2.notnull().sum()) # how many not null

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64


Ohio      False
Texas     False
Oregon    False
Utah      False
dtype: bool


4

- DataFrame:
    - it is like a table or spreadsheet
    - ordered list of columns
    - columns can have mixed types (e.g. numeric, boolean, strings, etc.)
    - anatomy:
        - each column is a pandas Series
        - the columns all share the same index, called the row index of the data frame
        - the names of the columns form a second index, called the column index

In [8]:
##### constructing dataframes:
data = {
    "state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada"],
    "year": [2000, 2001, 2002, 2001, 2002],
    "pop": [1.5, 1.7, 3.6, 2.4, 2.9]
}
df = pd.DataFrame(data)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [9]:
##### adding row-index
df = pd.DataFrame(data,
                 index = ["one", 
                          "two", 
                          "three", 
                          "four", 
                          "five"])
df

        state  year  pop
one      Ohio  2000  1.5
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nevada  2001  2.4
five   Nevada  2002  2.9

In [10]:
##### retrieving columns
print(df.state)

print("\n")

print(df["pop"])

print("\n")

print(df[["year", "state"]])

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object


one      1.5
two      1.7
three    3.6
four     2.4
five     2.9
Name: pop, dtype: float64


       year   state
one    2000    Ohio
two    2001    Ohio
three  2002    Ohio
four   2001  Nevada
five   2002  Nevada

In [11]:
##### retrieving rows
print(df.loc["three"])

print("\n")

print(df.loc[["two", "four"]])

print("\n")

print(df.loc["two":"four"])

state    Ohio
year     2002
pop       3.6
Name: three, dtype: object


       state  year  pop
two     Ohio  2001  1.7
four  Nevada  2001  2.4


        state  year  pop
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nevada  2001  2.4

In [12]:
##### boolean series indexing
df[df["pop"] > 2.5]

        state  year  pop
three    Ohio  2002  3.6
five   Nevada  2002  2.9

In [13]:
# do not use and, or and not
# use &, |, and ~
df[(df.state == "Ohio") & (df.year > 2000)]

      state  year  pop
two    Ohio  2001  1.7
three  Ohio  2002  3.6

In [14]:
df[~(df.state == "Nevada")]

      state  year  pop
one    Ohio  2000  1.5
two    Ohio  2001  1.7
three  Ohio  2002  3.6

### Pandas3
##### basic review and micellaneous methods:

##### 1. load hard-coded data into a dataframe
- a dataframe just like R dataframe

In [15]:
df = pd.DataFrame(
    [["Jan", 58, 42, 74, 22, 2.95],
    ["Feb", 61, 45, 78, 26, 3.02],
    ["Mar", 65, 48, 84, 25, 2.34],
    ["Apr", 67, 50, 92, 28, 1.02],
    ["May", 71, 53, 98, 35, 0.48],
    ["Jun", 75, 56, 107, 41, 0.11],
    ["Jul", 77, 58, 105, 44, 0.0],
    ["Aug", 77, 59, 102, 43, 0.03],
    ["Sep", 77, 57, 103, 40, 0.17],
    ["Oct", 73, 54, 96, 34, 0.81],
    ["Nov", 64, 48, 84, 30, 1.7],
    ["Dec", 58, 42, 73, 21, 2.56]],
    index = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11],
    columns = ["month", 
               "avg_high", 
               "avg_low", 
               "record_high", 
               "record_low", 
               "avg_precipitation"]
)

df

   month  avg_high  avg_low  record_high  record_low  avg_precipitation
0    Jan        58       42           74          22               2.95
1    Feb        61       45           78          26               3.02
2    Mar        65       48           84          25               2.34
3    Apr        67       50           92          28               1.02
4    May        71       53           98          35               0.48
5    Jun        75       56          107          41               0.11
6    Jul        77       58          105          44               0.00
7    Aug        77       59          102          43               0.03
8    Sep        77       57          103          40               0.17
9    Oct        73       54           96          34               0.81
10   Nov        64       48           84          30               1.70
11   Dec        58       42           73          21               2.56

In [16]:
##### 2. read text file into a dataframe

In [17]:
filename = "weather.txt"
df = pd.read_csv(filename)
df

   month  avg_high  avg_low  record_high  record_low  avg_precipitation
0    Jan        58       42           74          22               2.95
1    Feb        61       45           78          26               3.02
2    Mar        65       48           84          25               2.34
3    Apr        67       50           92          28               1.02
4    May        71       53           98          35               0.48
5    Jun        75       56          107          41               0.11
6    Jul        77       58          105          44               0.00
7    Aug        77       59          102          43               0.03
8    Sep        77       57          103          40               0.17
9    Oct        73       54           96          34               0.81
10   Nov        64       48           84          30               1.70
11   Dec        58       42           73          21               2.56

##### 3. print first 5 or last 2 of df

In [18]:
df.head()   # default

  month  avg_high  avg_low  record_high  record_low  avg_precipitation
0   Jan        58       42           74          22               2.95
1   Feb        61       45           78          26               3.02
2   Mar        65       48           84          25               2.34
3   Apr        67       50           92          28               1.02
4   May        71       53           98          35               0.48

In [19]:
df.tail(2)

   month  avg_high  avg_low  record_high  record_low  avg_precipitation
10   Nov        64       48           84          30               1.70
11   Dec        58       42           73          21               2.56

##### 4. get data types, index, columns, values

In [20]:
print(df.dtypes)
print("\n")
print(df.index)
print("\n")
print(df.columns)
print("\n")
print(df.values)

month                 object
avg_high               int64
avg_low                int64
record_high            int64
record_low             int64
avg_precipitation    float64
dtype: object


RangeIndex(start=0, stop=12, step=1)


Index(['month', 'avg_high', 'avg_low', 'record_high', 'record_low',
       'avg_precipitation'],
      dtype='object')


[['Jan' 58 42 74 22 2.95]
 ['Feb' 61 45 78 26 3.02]
 ['Mar' 65 48 84 25 2.34]
 ['Apr' 67 50 92 28 1.02]
 ['May' 71 53 98 35 0.48]
 ['Jun' 75 56 107 41 0.11]
 ['Jul' 77 58 105 44 0.0]
 ['Aug' 77 59 102 43 0.03]
 ['Sep' 77 57 103 40 0.17]
 ['Oct' 73 54 96 34 0.81]
 ['Nov' 64 48 84 30 1.7]
 ['Dec' 58 42 73 21 2.56]]

##### 5. descriptive statistics

In [21]:
df.describe()

        avg_high    avg_low  record_high  record_low  avg_precipitation
count  12.000000  12.000000    12.000000   12.000000          12.000000
mean   68.583333  51.000000    91.333333   32.416667           1.265833
std     7.366488   6.060303    12.323911    8.240238           1.186396
min    58.000000  42.000000    73.000000   21.000000           0.000000
25%    63.250000  47.250000    82.500000   25.750000           0.155000
50%    69.000000  51.500000    94.000000   32.000000           0.915000
75%    75.500000  56.250000   102.250000   40.250000           2.395000
max    77.000000  59.000000   107.000000   44.000000           3.020000

##### 6. sort records by any column

In [22]:
df.sort_values("record_high", ascending=False)

   month  avg_high  avg_low  record_high  record_low  avg_precipitation
5    Jun        75       56          107          41               0.11
6    Jul        77       58          105          44               0.00
8    Sep        77       57          103          40               0.17
7    Aug        77       59          102          43               0.03
4    May        71       53           98          35               0.48
9    Oct        73       54           96          34               0.81
3    Apr        67       50           92          28               1.02
2    Mar        65       48           84          25               2.34
10   Nov        64       48           84          30               1.70
1    Feb        61       45           78          26               3.02
0    Jan        58       42           74          22               2.95
11   Dec        58       42           73          21               2.56

##### 7. slicing records

In [23]:
print(df.avg_low)   # index with single column

print("\n")

print(df["avg_low"])

0     42
1     45
2     48
3     50
4     53
5     56
6     58
7     59
8     57
9     54
10    48
11    42
Name: avg_low, dtype: int64


0     42
1     45
2     48
3     50
4     53
5     56
6     58
7     59
8     57
9     54
10    48
11    42
Name: avg_low, dtype: int64

In [24]:
# index with single column (rows 2 to 3)
# note the bigger index is open
df[2:4]

  month  avg_high  avg_low  record_high  record_low  avg_precipitation
2   Mar        65       48           84          25               2.34
3   Apr        67       50           92          28               1.02

In [25]:
df[["avg_low", "avg_high"]]

    avg_low  avg_high
0        42        58
1        45        61
2        48        65
3        50        67
4        53        71
5        56        75
6        58        77
7        59        77
8        57        77
9        54        73
10       48        64
11       42        58

In [26]:
# multiple columns: 
# df.loc - location
# df.loc[from:to, ["col1", "col2", ...]]
df.loc[:,["avg_low", "avg_high"]]

    avg_low  avg_high
0        42        58
1        45        61
2        48        65
3        50        67
4        53        71
5        56        75
6        58        77
7        59        77
8        57        77
9        54        73
10       48        64
11       42        58

In [27]:
# slicing scalar value
print(df.loc[9, ["avg_precipitation"]])

avg_precipitation    0.81
Name: 9, dtype: object

In [28]:
# index location can receive range or list of indices
# df.iloc[row_range, [col1_i, col2_i]] - index location
df.iloc[3:5, [0,3]]   # 5 is not inclusive

  month  record_high
3   Apr           92
4   May           98

##### 8. filtering

In [29]:
df[df.avg_precipitation > 1.0]

   month  avg_high  avg_low  record_high  record_low  avg_precipitation
0    Jan        58       42           74          22               2.95
1    Feb        61       45           78          26               3.02
2    Mar        65       48           84          25               2.34
3    Apr        67       50           92          28               1.02
10   Nov        64       48           84          30               1.70
11   Dec        58       42           73          21               2.56

In [30]:
# isin
df[df["month"].isin(["Jun", "Jul", "Aug"])]

  month  avg_high  avg_low  record_high  record_low  avg_precipitation
5   Jun        75       56          107          41               0.11
6   Jul        77       58          105          44               0.00
7   Aug        77       59          102          43               0.03

##### 9. assignment

In [31]:
df.loc[9, ["avg_precipitation"]] = 101.3
df.iloc[9:11]

   month  avg_high  avg_low  record_high  record_low  avg_precipitation
9    Oct        73       54           96          34              101.3
10   Nov        64       48           84          30                1.7

In [32]:
df.loc[9, ["avg_precipitation"]] = np.nan
df.iloc[9:11]

   month  avg_high  avg_low  record_high  record_low  avg_precipitation
9    Oct        73       54           96          34                NaN
10   Nov        64       48           84          30                1.7

In [33]:
df.loc[:, "avg_low"] = np.array([5] * len(df))
df.head()

  month  avg_high  avg_low  record_high  record_low  avg_precipitation
0   Jan        58        5           74          22               2.95
1   Feb        61        5           78          26               3.02
2   Mar        65        5           84          25               2.34
3   Apr        67        5           92          28               1.02
4   May        71        5           98          35               0.48

In [34]:
df["avg_day"] = (df.avg_low + df.avg_high) / 2
df.head()

,month,avg_high,avg_low,record_high,record_low,avg_precipitation,avg_day
0,Jan,58,5,74,22,2.95,31.5
1,Feb,61,5,78,26,3.02,33.0
2,Mar,65,5,84,25,2.34,35.0
3,Apr,67,5,92,28,1.02,36.0
4,May,71,5,98,35,0.48,38.0

##### 10. renaming columns

In [35]:
# rename 1 column
df.rename(columns = {"avg_precipitation": "avg_rain"}, 
          inplace = True)
df.head()

# or df = df.rename(...) - no need for inplace=True

  month  avg_high  avg_low  record_high  record_low  avg_rain  avg_day
0   Jan        58        5           74          22      2.95     31.5
1   Feb        61        5           78          26      3.02     33.0
2   Mar        65        5           84          25      2.34     35.0
3   Apr        67        5           92          28      1.02     36.0
4   May        71        5           98          35      0.48     38.0

In [36]:
# renaming all columns
df.columns = ["month", 
              "av_hi", 
              "av_lo", 
              "rec_hi",
              "rec_lo",
              "av_rain",
              "av_day"]
df.head()

  month  av_hi  av_lo  rec_hi  rec_lo  av_rain  av_day
0   Jan     58      5      74      22     2.95    31.5
1   Feb     61      5      78      26     3.02    33.0
2   Mar     65      5      84      25     2.34    35.0
3   Apr     67      5      92      28     1.02    36.0
4   May     71      5      98      35     0.48    38.0

##### 11. iterate a df

In [37]:
filename = "weather.txt"
df = pd.read_csv(filename)

for i, row in df.iterrows():
    print (i, row["month"], row["avg_high"])

0 Jan 58
1 Feb 61
2 Mar 65
3 Apr 67
4 May 71
5 Jun 75
6 Jul 77
7 Aug 77
8 Sep 77
9 Oct 73
10 Nov 64
11 Dec 58

##### 12. write to csv file

In [38]:
df.to_csv("edited.csv")

### NumPy

##### 1. ndarray(n-dimensional array):
##### benefits:
- ndarrays are fast and space efficient multidimensional arrays
- vectorized arithmetic operations and broadcasting capabilities
- many useful mathematical functions, especially matrix operations

##### limitations:
- no high-level data analysis functionality

##### 1. create an ndarray:

In [39]:
import numpy as np
arr = np.array([[0, 1.5, 2.0],
               [-1.0, 3.0, 5.0]])

print(type(arr))
print(arr)

<class 'numpy.ndarray'>
[[ 0.   1.5  2. ]
 [-1.   3.   5. ]]

##### 2. getting its dimensions using the shape attribute:

In [40]:
arr = np.array([[0, 1.5, 2.0],
               [-1.0, 3.0, 5.0]])

print(arr.shape)

(2, 3)

##### 3. basic arithmetic

In [41]:
arr = np.array([[0, 1.5, 2.0],
               [-1.0, 3.0, 5.0]])

print(arr * 2)

print("\n")

print(arr + arr)

print("\n")

print(arr * arr)

[[ 0.  3.  4.]
 [-2.  6. 10.]]


[[ 0.  3.  4.]
 [-2.  6. 10.]]


[[ 0.    2.25  4.  ]
 [ 1.    9.   25.  ]]

##### 4. indexing
- you could index an ndarray like a list on the surface

In [42]:
arr = np.array([[0, 1.5, 2.0],
               [-1.0, 3.0, 5.0]])

print(arr[1])

print("\n")

print(arr[1][1:3]) # the right index is not closed

[-1.  3.  5.]


[3. 5.]

- you can assign a value to a slice of an ndarray:

In [43]:
arr = np.array([[0, 1.5, 2.0],
               [-1.0, 3.0, 5.0]])
arr[1][:] = 0

print(arr)

[[0.  1.5 2. ]
 [0.  0.  0. ]]

##### 5. mathematical functions

In [44]:
arr = np.array([[0, 1.5, 2.0],
               [-1.0, 3.0, 5.0]])

print(arr.sum())
print(arr.min())
print(arr.max())
print(arr.std())

10.5
-1.0
5.0
1.9525624189766635

- mathematic functions per axis
  - in addition to calculating values across the entire ndarray you can calculate per axis:

In [45]:
arr = np.array([[0, 1.5, 2.0],
               [-1.0, 3.0, 5.0]])

print(arr.sum(axis=0)) # row sums - vertical
print(arr.sum(axis=1)) # col sums - horizontal

[-1.   4.5  7. ]
[3.5 7. ]

### Pandas2
##### Pandas Aggregations and Transformations etc.

##### 1. describing data

In [46]:
df = pd.read_csv("salaries.csv")
df.shape

(33183, 8)

In [47]:
df.columns

Index(['Name', 'Job Titles', 'Department', 'Full or Part-Time',
       'Salary or Hourly', 'Typical Hours', 'Annual Salary', 'Hourly Rate'],
      dtype='object')

In [48]:
df["Typical Hours"].describe()

count    8022.000000
mean       34.507604
std         9.252077
min        10.000000
25%        20.000000
50%        40.000000
75%        40.000000
max        40.000000
Name: Typical Hours, dtype: float64

In [49]:
df["Typical Hours"].mean()

34.50760408875592

In [50]:
# the proportion of missing values in a Series
df["Typical Hours"].isnull().mean()

0.7582497061748485

In [51]:
# missing proportions in df
df.isnull().mean()

Name                 0.00000
Job Titles           0.00000
Department           0.00000
Full or Part-Time    0.00000
Salary or Hourly     0.00000
Typical Hours        0.75825
Annual Salary        0.24175
Hourly Rate          0.75825
dtype: float64

In [52]:
# value_counts
df.Department.value_counts()

POLICE                   13414
FIRE                      4641
STREETS & SAN             2198
OEMC                      2102
WATER MGMNT               1879
AVIATION                  1629
TRANSPORTN                1140
PUBLIC LIBRARY            1015
GENERAL SERVICES           980
FAMILY & SUPPORT           615
FINANCE                    560
HEALTH                     488
CITY COUNCIL               411
LAW                        407
BUILDINGS                  269
COMMUNITY DEVELOPMENT      207
BUSINESS AFFAIRS           171
COPA                       116
BOARD OF ELECTION          107
DoIT                        99
PROCUREMENT                 92
INSPECTOR GEN               87
MAYOR'S OFFICE              85
CITY CLERK                  84
ANIMAL CONTRL               81
HUMAN RESOURCES             79
CULTURAL AFFAIRS            65
BUDGET & MGMT               46
ADMIN HEARNG                39
DISABILITIES                28
TREASURER                   22
HUMAN RELATIONS             16
BOARD OF ETHICS              8
POLICE BOARD                 2
LICENSE APPL COMM            1
Name: Department, dtype: int64

In [53]:
# checking full or part time for example
df["Full or Part-Time"].value_counts()

F    31090
P     2093
Name: Full or Part-Time, dtype: int64

In [54]:
# Type conversion
# store full or parttime as boolean
df["Full-time"] = df["Full or Part-Time"] == "F"
df.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Full-time
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,$101442.00,NaN,True
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,$94122.00,NaN,True
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,$101592.00,NaN,True
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,$110064.00,NaN,True
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,$19.86,False

In [55]:
# subsetting to full time employees
df[df["Full-time"]].head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Full-time
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,$101442.00,NaN,True
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,$94122.00,NaN,True
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,$101592.00,NaN,True
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,$110064.00,NaN,True
5,"ABBASI, CHRISTOPHER",STAFF ASST TO THE ALDERMAN,CITY COUNCIL,F,Salary,NaN,$50436.00,NaN,True

In [56]:
# subsetting part-time employees
df[~df["Full-time"]].head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Full-time
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,$19.86,False
10,"ABBOTT, BETTY L",FOSTER GRANDPARENT,FAMILY & SUPPORT,P,Hourly,20.0,NaN,$2.65,False
18,"ABDULLAH, LAKENYA N",CROSSING GUARD,OEMC,P,Hourly,20.0,NaN,$17.68,False
26,"ABIOYE, ADEWOLE A",LIBRARY ASSOCIATE - HOURLY,PUBLIC LIBRARY,P,Hourly,20.0,NaN,$25.10,False
90,"ACHA, SHARAZAN MARLENE",POOL MOTOR TRUCK DRIVER,STREETS & SAN,P,Hourly,10.0,NaN,$28.48,False

##### 2. agg

In [57]:
df_original = pd.read_csv("abm_results-1.csv")
df_original[["integration", "num_happy"]].agg({"integration": sum, 
                                               "num_happy": np.mean})

integration     13.640000
num_happy      351.777778
dtype: float64

##### 3. map, apply, applymap
- map: every entry in a row
- apply: need to specify row or column (multiple cols)
- applymap: every entry in a df

In [58]:
# option one
df["Typical Hours"].apply(np.sqrt).head()

0         NaN
1         NaN
2         NaN
3         NaN
4    4.472136
Name: Typical Hours, dtype: float64

In [59]:
# option two
df["Typical Hours"].map(np.sqrt).head()

0         NaN
1         NaN
2         NaN
3         NaN
4    4.472136
Name: Typical Hours, dtype: float64

In [60]:
df_original["integration"].map(lambda c: c+1)

0    4.76
1    2.81
2    2.27
3    2.26
4    2.26
5    2.10
6    2.09
7    2.07
8    2.02
Name: integration, dtype: float64

In [61]:
df_original["integration"].map(lambda c: "integration level is {}".format(c))

0    integration level is 3.76
1    integration level is 1.81
2    integration level is 1.27
3    integration level is 1.26
4    integration level is 1.26
5     integration level is 1.1
6    integration level is 1.09
7    integration level is 1.07
8    integration level is 1.02
Name: integration, dtype: object

In [62]:
df_original.dtypes

turn             int64
integration    float64
num_happy        int64
num_moved        int64
num_stayed       int64
dtype: object

In [63]:
# across a list of two columns
df_original[["num_happy", "num_moved"]]\
    .apply(lambda r: r["num_happy"] + r["num_moved"], axis=1)

# {0 or ‘index’, 1 or ‘columns’}, default 0

0    263
1    380
2    380
3    380
4    380
5    380
6    380
7    380
8    380
dtype: int64

In [64]:
# applymap - every single cell - universal
df_original[["integration", "num_happy", "num_moved"]].applymap(lambda c: c+1)

   integration  num_happy  num_moved
0         4.76        264          1
1         2.81        272        110
2         2.27        354         28
3         2.26        380          2
4         2.26        381          1
5         2.10        381          1
6         2.09        381          1
7         2.07        381          1
8         2.02        381          1

In [65]:
# passing in your own function
def get_first_name(name):
    first_middle = name.split(",  ")[1]
    first = first_middle.split(" ")[0]
    
    return first

df.Name.apply(get_first_name).head()

0      JEFFERY
1       KARINA
2    KIMBERLEI
3      VICENTE
4        REECE
Name: Name, dtype: object

In [66]:
df["First Name"] = df.Name.apply(get_first_name)

# value_counts()
df["First Name"].value_counts().head()

MICHAEL    1151
JOHN        856
JAMES       645
ROBERT      587
JOSEPH      540
Name: First Name, dtype: int64

In [67]:
# check for more string methods
# str.find() - returns index of the found values
(df["Job Titles"].str.find("DETECTIVE") >= 0).sum()

989

In [68]:
df["Annual Salary"] = df["Annual Salary"].str[1:].astype(float)
df["Annual Salary"].describe()

count     25161.000000
mean      86786.999790
std       21041.354602
min        7200.000000
25%       76266.000000
50%       90024.000000
75%       96060.000000
max      300000.000000
Name: Annual Salary, dtype: float64

In [69]:
# sort_values(ascending=False)
df.sort_values("Annual Salary", ascending=False).head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Full-time,First Name
8439,"EVANS, GINGER S",COMMISSIONER OF AVIATION,AVIATION,F,Salary,NaN,300000.0,NaN,True,GINGER
14221,"JOHNSON, EDDIE T",SUPERINTENDENT OF POLICE,POLICE,F,Salary,NaN,260004.0,NaN,True,EDDIE
8198,"EMANUEL, RAHM",MAYOR,MAYOR'S OFFICE,F,Salary,NaN,216210.0,NaN,True,RAHM
26424,"SANTIAGO, JOSE A",FIRE COMMISSIONER,FIRE,F,Salary,NaN,202728.0,NaN,True,JOSE
9226,"FORD II, RICHARD C",FIRST DEPUTY FIRE COMMISSIONER,FIRE,F,Salary,NaN,197736.0,NaN,True,RICHARD

##### 4. merging:
- concat: stacking up 
    - [check the docs](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html)
- merge (SQL join): 
    - inner
    - left
    - right
    - outer
    - [check the docs](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html)
- join (convenient)